
all_dict = {"为您推荐": {"全部": [], "心动迪士尼": [], "出游正当时": [], "去玩海岛游": [], "亲子度假": [], "放假日本": [], "欧美澳新": [], "省心邮轮季": []},
            "出境游": {"东南亚": [], "海岛": [], "日本": [], "欧洲": [], "中东非": [], "美洲": [], "澳新 ": [], "港澳台": []},
            "境内游": {"海南": [], "云南": [], "西北": [], "广西": [], "福建": [], "北京": [], "陕西": [], "湖南": []},
            "周边游": {"精选": [], "踏青赏花": [], "名山胜水": [], "城市/乐园": [], "古镇": [], "高铁/动车": [], "巴士自由行": [], "酒店+景点": []}}

for k, v in all_dict.items():

    for i, j in all_dict[k].items():
        a = 1
        c = [{'a': '1'}, {'b': '2'}]
        a += 1
        all_dict[k][i] = c

print(all_dict)
